---
kind: method
id: M:Autodesk.Revit.DB.View3D.GetRenderingSettings
zh: 三维视图、3d视图
source: html/a19af989-a2fd-7b22-2f88-0dd4d160b042.htm
---
# Autodesk.Revit.DB.View3D.GetRenderingSettings Method

**中文**: 三维视图、3d视图

Returns the current rendering settings for this 3d view.

## Syntax (C#)
```csharp
public RenderingSettings GetRenderingSettings()
```

## Returns
The returned object represents the current rendering settings.
 If you change the returned object, you need to call SetRenderingSettings to apply the new settings back to Revit.